ValidatePostalRequest/xml/ValidatePostalRequest.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/cnty/v3">
   <SOAP-ENV:Body>
      <ValidatePostalRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key/>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber/>
            <MeterNumber/>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId/>
         </TransactionDetail>
         <Version>
            <ServiceId>cnty</ServiceId>
            <Major>3</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
		 <Address>
			 <StreetLines/>
			 <City/>
			 <StateOrProvinceCode/>
			 <PostalCode/>
			 <CountryCode/>
			 <Residential>1</Residential>
		 </Address>
		 <RoutingCode>FDSD</RoutingCode>
		 <CheckForMismatch>1</CheckForMismatch>
		 <CarrierCode>FDXE</CarrierCode>
      </ValidatePostalRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
